//////////////////////////////////////////////////////////////////////
//																	//
// main.cpp															//
//																	//
// Тестирование работы генератора случайных чисел (вариант 10)		//
//																	//
//////////////////////////////////////////////////////////////////////


#include <iostream>
#include <Windows.h>

#include "FibRand.h"


int main() {

	// рандомизация дэфолтного рнадомайзера
	srand(GetTickCount64());

	// объект класса генератора (можно оставть без параметров, будут заданы значения по умолчанию)
	FibRand Rand(1,2,3,6,100);

	// рандомизация генератора рандомными значениями дэфолтного рандомайзера
	Rand.seed(5, rand(), rand(), rand(), rand(), rand());

	for (int i = 0; i < 1000; i++) {
		std::cout << Rand.getValue() << "\t";
		if (i % 30 == 0) {
			std::cout << "\n";
		}
	}
	std::cout << "\n";


	return 0;

}
