//////////////////////////////////////////////////////////////////////
//																	//
// main.cpp															//
//																	//
// Тестирование работы генератора случайных чисел (вариант 10)		//
//																	//
//////////////////////////////////////////////////////////////////////


#include <iostream>
#include <Windows.h>

#include "FibRand.h"


int main() {

	seed(5, 112, 1242, 443, 4, 95);

	for (int i = 0; i < 1000; i++) {
		std::cout << getRand() << "\t";
		if (i % 30 == 0) {
			std::cout << "\n";
		}
	}
	std::cout << "\n";


	return 0;

}